quartet_integrations/templates/frequentz/confirm_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tag="http://www.ibm.com/epcis/serialid/TagManagerTypes">
   	<soapenv:Header>
   	    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1">
			<wsse:UsernameToken wsu:Id="UsernameToken-C9947086B20F6739951582658155697100">
				<wsse:Username>{{ username }}</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{ password }}</wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">tARKQHhr58bBk1FuoWThBQ==</wsse:Nonce>
				<wsu:Created>{{ created }}</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
   <soapenv:Body>
      <tag:confirmTagsRequest>
         <tag:requestId>{{ request_id }}</tag:requestId>
      </tag:confirmTagsRequest>
   </soapenv:Body>
</soapenv:Envelope>